In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd
import os
import numpy as np

In [4]:
file=os.listdir('E:/Weekly Payments/payment_file')

FileNotFoundError: [WinError 3] The system cannot find the path specified: 'E:/Weekly Payments/payment_file'

In [4]:
file

['report_1650088444.xlsx']

In [5]:
data=pd.read_excel('E:/Weekly Payments/payment_file/'+file[0],sheet_name=None)

In [3]:
data=pd.read_excel(r'C:\Users\snappfood\Desktop\financial\report_1650088444.xlsx',sheet_name=None)

In [6]:
list(data.keys())

['tehran', 'no sheba', 'payment']

In [4]:
for name in list(data.keys()):
    print(name.lower())
    data[name.lower()]=data.pop(name)

tehran
no sheba
payment

In [8]:
data.keys()

dict_keys(['tehran', 'no sheba', 'payment'])

In [5]:
data['tehran'].rename(str.lower, axis='columns', inplace=True)
data['payment'].rename(str.lower, axis='columns', inplace=True)
data['no sheba'].rename(str.lower, axis='columns', inplace=True)
#data['report'].rename(str.lower, axis='columns', inplace=True)

In [10]:
data['tehran'].columns

Index(['biker id', 'firstname', 'lastname', 'name_family', 'cellphone',
       'nationalid', 'sheba number', 'city code', 'morning rides',
       'lunch rides', 'dinner rides', 'single trips', 'batched trips',
       'express trips', 'batched payable', 'single payable',
       'avg payable per trip', 'total incentives', 'extra', 'penalty', 'bonus',
       'guarantee', 'map report', 'equipment', 'vendor delay',
       'cancellation fee', 'cash cod', 'cash biker request',
       'delivery fee biker request', 'lead', 'remained from last week',
       'credit', 'total payable'],
      dtype='object')

## 1. Preprocessing

In [7]:
import re

In [11]:
for i in range(len(data['payment'])):
    x=re.search('^i', str(data['payment']['sheba number'].iloc[i]))
    if str(type(x))!=str("<class 'NoneType'>"):        
        print(x)
        print(i)
        print(data['payment'][['firstname','lastname']].iloc[i])
        print(data['payment']['sheba number'].iloc[i])

In [6]:
# bikers with problem in their sheba number
c=0
wrong_sheba_tehran=pd.DataFrame()
for i in range(len(data['tehran'])):
    if len(str(data['tehran']['sheba number'].iloc[i]))!=26:
        wrong_sheba_tehran=wrong_sheba_tehran.append(data['tehran'].iloc[i])
        c+=1
print(c)
wrong_sheba_tehran

66

,biker id,firstname,lastname,cellphone,nationalid,sheba number,city code,morning rides,lunch rides,dinner rides,...,equipment,vendor delay,cancellation fee,cash cod,cash biker request,delivery fee biker request,lead,remained from last week,credit,total payable
1045,7781.0,حمیدرضا,فرهمند,9.174009e+09,3.660514e+09,IR48013010000000309188520,tehran,0.0,51.0,7.0,...,0.0,28000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,768000.0
1146,10426.0,NaN,علی باقری اصل,9.210125e+09,4.160327e+09,NaN,tehran,0.0,12.0,17.0,...,0.0,8000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,389500.0
3175,24264.0,محمد رضا,جعفری موگوئی,9.196891e+09,2.190660e+07,NaN,tehran,0.0,0.0,5.0,...,0.0,4000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,53000.0
3267,25572.0,عظیم,احمدی مقدم جوزان,9.197373e+09,8.731470e+08,IR60540123380002399184005,tehran,0.0,64.0,14.0,...,0.0,16000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,949000.0
3465,28261.0,رضا,فندرسکی,9.195144e+09,2.269790e+09,NaN,tehran,1.0,0.0,44.0,...,0.0,4000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,609700.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5538,49549.0,سامان,یوسفی,9.120711e+09,4.180193e+09,NaN,tehran,6.0,33.0,9.0,...,0.0,4000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,607000.0
5544,49593.0,مهدی,شریفی,9.186506e+09,3.790487e+09,NaN,tehran,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,14000.0
5547,49609.0,ابراهیم,ابراهیمی,9.366376e+09,2.480394e+09,NaN,tehran,7.0,3.0,5.0,...,0.0,8000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,203000.0
5549,49625.0,محمد,نوری,9.393553e+09,4.860052e+09,NaN,tehran,6.0,4.0,4.0,...,0.0,12000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,260000.0
5550,49629.0,حمیدرضا,عبدالله زاده,9.374086e+09,2.236381e+07,NaN,tehran,0.0,28.0,34.0,...,0.0,60000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,695600.0

In [13]:
# OUTPUT
wrong_sheba_tehran.to_excel('E:/Weekly Payments/Output_files/wrong_sheba_tehran.xlsx')

FileNotFoundError: [Errno 2] No such file or directory: 'E:/Weekly Payments/Output_files/wrong_sheba_tehran.xlsx'

In [8]:
wrong_sheba=wrong_sheba_tehran[['biker id','sheba number','lastname','total payable']]
noSheba=data['no sheba'][['biker id','sheba number','lastname','total payable']]

In [9]:
wrong_sheba.fillna(0,inplace=True)
noSheba.fillna(0, inplace=True)

C:\Users\snappfood\anaconda3\lib\site-packages\pandas\core\frame.py:5176: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [17]:
# Compare Wrong shebas from tehran and No Sheba sheet to see if they are equal or not
no_sheba_merged=pd.merge(wrong_sheba,noSheba,on='biker id',how='left')

In [18]:
no_sheba_merged

,biker id,sheba number_x,name_family_x,total payable_x,sheba number_y,name_family_y,total payable_y
0,7781.0,IR48013010000000309188520,حمیدرضا فرهمند,768000.0,IR48013010000000309188520,حمیدرضا فرهمند,768000
1,10426.0,0,علی باقری اصل,389500.0,0,علی باقری اصل,389500
2,24264.0,0,محمد رضا جعفری موگوئی,53000.0,0,محمد رضا جعفری موگوئی,53000
3,25572.0,IR60540123380002399184005,عظیم احمدی مقدم جوزان,949000.0,IR60540123380002399184005,عظیم احمدی مقدم جوزان,949000
4,28261.0,0,رضا فندرسکی,609700.0,0,رضا فندرسکی,609700
...,...,...,...,...,...,...,...
61,49549.0,0,سامان یوسفی,607000.0,0,سامان یوسفی,607000
62,49593.0,0,مهدی شریفی,14000.0,0,مهدی شریفی,14000
63,49609.0,0,ابراهیم ابراهیمی,203000.0,0,ابراهیم ابراهیمی,203000
64,49625.0,0,محمد نوری,260000.0,0,محمد نوری,260000
65,49629.0,0,حمیدرضا عبدالله زاده,695600.0,0,حمیدرضا عبدالله زاده,695600

In [10]:
no_sheba_merged2=pd.merge(noSheba,wrong_sheba,on='biker id',how='left')

In [11]:
no_sheba_merged2

,biker id,sheba number_x,lastname_x,total payable_x,sheba number_y,lastname_y,total payable_y
0,7781,IR48013010000000309188520,فرهمند,768000,IR48013010000000309188520,فرهمند,768000.0
1,10426,0,علی باقری اصل,389500,0,علی باقری اصل,389500.0
2,24264,0,جعفری موگوئی,53000,0,جعفری موگوئی,53000.0
3,25572,IR60540123380002399184005,احمدی مقدم جوزان,949000,IR60540123380002399184005,احمدی مقدم جوزان,949000.0
4,28261,0,فندرسکی,609700,0,فندرسکی,609700.0
...,...,...,...,...,...,...,...
61,49549,0,یوسفی,607000,0,یوسفی,607000.0
62,49593,0,شریفی,14000,0,شریفی,14000.0
63,49609,0,ابراهیمی,203000,0,ابراهیمی,203000.0
64,49625,0,نوری,260000,0,نوری,260000.0
65,49629,0,عبدالله زاده,695600,0,عبدالله زاده,695600.0

In [6]:
# OUTPUT
# wrong sheba numbers which are not in No Sheba sub sheet (if any)
missed_no_sheba=pd.DataFrame()
counter=0
if no_sheba_merged['sheba number_x'].isnull().sum()==0:
    print('wrong sheba numbers are the same in both files')
    print(no_sheba_merged['sheba number_x'].isnull().sum())
    print(no_sheba_merged2['sheba number_y'].isnull().sum())
else:
    print('here we found '+str(no_sheba_merged['sheba number_y'].isnull().sum())+' sheba numbers')
    missed_no_sheba=missed_no_sheba.append(no_sheba_merged[no_sheba_merged['sheba number_y'].isnull()])
# if counter>0:
#     print("out put is missed wrong sheba users")
#     missed_no_sheba.to_excel('E:/Weekly Payments/missed_n_sheba.xlsx')
# else:
#     print('no output')

NameError: name 'no_sheba_merged' is not defined

In [22]:
data['tehran']['sheba number'].value_counts()

IR630170000000355202859009    1
IR200120010000005613680383    1
IR520120010000003389568650    1
IR460540104847000312825606    1
IR740170000000346580086006    1
                             ..
IR090160000000000948900232    1
IR440170000000310693664003    1
IR690140040000710058443510    1
IR840640011670000682278001    1
IR400120000000008699763894    1
Name: sheba number, Length: 5500, dtype: int64

In [7]:
# Find duplicate sheba numbers
more_than_one=pd.DataFrame()
values=data['tehran']['sheba number'].value_counts().to_dict()
keys=list(values.keys())
for i in range(len(values)):
    if values[keys[i]]>1:
        more_than_one=more_than_one.append(data['tehran'][data['tehran']['sheba number']==keys[i]])

In [25]:
more_than_one

Empty DataFrame
Columns: []
Index: []

In [26]:
#set(list(more_than_one['Sheba Number'].values))

In [27]:
# export zero_express_trips users from tehran subsheet
data['tehran'][data['tehran']['express trips']==0].to_excel('E:/Weekly Payments/Output_files/zero_express_tehran.xlsx')

In [28]:
# export zero_express_trips from payment subsheet
data['payment'][data['payment']['express trips']==0].to_excel('E:/Weekly Payments/Output_files/zero_express_payment.xlsx')

### duplicate biker id

In [4]:
# find duplicate biker id
# OUTPUT: rows with duplicate biker id
dup_biker_id=pd.DataFrame()
count=0
values=data['tehran']['biker id'].value_counts().to_dict()
keys=list(values.keys())
for i in range(len(values)):
    if values[keys[i]]>1:
        count+=1
        dup_biker_id=dup_biker_id.append(data['tehran'][data['tehran']['biker id']==keys[i]])
print('Found '+str(count)+' duplicate biker id')
if count>0:
    dup_biker_id.to_excel('E:/Weekly Payments/Output_files/duplicate_biker_ids.xlsx')
dup_biker_id

KeyError: 'biker id'

In [30]:
# finds duplicate cellphones
# OUTPUT: file that contains rows of data with duplicate cellphones
dup_Cellphone=pd.DataFrame()
count=0
values=data['tehran']['cellphone'].value_counts().to_dict()
keys=list(values.keys())
for i in range(len(values)):
    if values[keys[i]]>1:
        count+=1
        dup_Cellphone=dup_Cellphone.append(data['tehran'][data['tehran']['cellphone']==keys[i]])
print('Found '+str(count)+' duplicate phone numbers')
if count>0:
    dup_Cellphone.to_excel('E:/Weekly Payments/Output_files/duplicate_cell_phone.xlsx')
dup_Cellphone

Found 0 duplicate phone numbers

Empty DataFrame
Columns: []
Index: []

### filter positiva total payable values from tehran sub sheet

In [31]:
positive_payable=data['tehran'][data['tehran']['total payable']>0]
print(positive_payable.shape)

(5550, 33)

In [29]:
# filter negative total Payable
negative_payable=data['tehran'][data['tehran']['total payable']<=0]
print(negative_payable.shape)

(14, 32)

### remove no sheba data from positive payables

In [33]:
positive_payable_no_sheba_removed=positive_payable[~positive_payable['biker id'].isin(data['no sheba']['biker id'])]

In [34]:
positive_payable_no_sheba_removed.shape

(5484, 33)

In [35]:
tehran_positive_payable=positive_payable_no_sheba_removed[['biker id', 'total payable', 'name_family','sheba number']]
pay_data=data['payment'][['biker id', 'total payable', 'name_family', 'sheba number'] ]

In [36]:
mi=pd.merge(tehran_positive_payable, pay_data, on='biker id', how='left')

In [37]:
mi

,biker id,total payable_x,name_family_x,sheba number_x,total payable_y,name_family_y,sheba number_y
0,16,755500,مرتضی بخشی,IR350170000000302202936005,755500,مرتضی بخشی,IR350170000000302202936005
1,277,4050400,مصطفی خفاجه نیا,IR360150000000817302320910,4050400,مصطفی خفاجه نیا,IR360150000000817302320910
2,289,3598000,رضا پروین,IR750600380970011115506001,3598000,رضا پروین,IR750600380970011115506001
3,303,2358000,محمد ازاد,IR190170000000212611964006,2358000,محمد ازاد,IR190170000000212611964006
4,307,908500,بهروز مومنی ثانی رشخوار,IR470540103282000099657001,908500,بهروز مومنی ثانی رشخوار,IR470540103282000099657001
...,...,...,...,...,...,...,...
5479,49685,498000,عاشور خواجوی,IR190150000003130001739096,498000,عاشور خواجوی,IR190150000003130001739096
5480,49689,48000,معرفت احمدی,IR470150000003130004395228,48000,معرفت احمدی,IR470150000003130004395228
5481,49697,395000,مهدی میرزایی,IR230170000000218759052008,395000,مهدی میرزایی,IR230170000000218759052008
5482,49701,165000,علی مرادی,IR430190000000116903927007,165000,علی مرادی,IR430190000000116903927007
5483,49705,60000,میلاد آدینه وند,IR280170000000355344471006,60000,میلاد آدینه وند,IR280170000000355344471006

In [38]:
# users who are in tehran list and not in payment list
mi[mi['sheba number_y'].isnull()]

Empty DataFrame
Columns: [biker id, total payable_x, name_family_x, sheba number_x, total payable_y, name_family_y, sheba number_y]
Index: []

In [39]:
mi[mi['sheba number_x'].isnull()]

Empty DataFrame
Columns: [biker id, total payable_x, name_family_x, sheba number_x, total payable_y, name_family_y, sheba number_y]
Index: []

In [40]:
if mi['sheba number_y'].isnull().sum()==0:
    print('payable bikers in both sheers -Tehran and Payment - are the same')
else:
    print('ERROR-> OUTPUT: users who are in tehran file and not in payment file')
    output=mi[mi['sheba number_y'].isnull()]
    output.to_excel('E:/Weekly Payments/missed_in_payment_bikers.xlsx')

payable bikers in both sheers -Tehran and Payment - are the same

In [41]:
tehran_comp_data=data['tehran']
noSheba_comp_data=data['no sheba']
payment_comp_data=data['payment']

In [42]:
# remove no sheba and also remove negative payables from tehran sub sheet
tehran_comp_data=tehran_comp_data[tehran_comp_data['total payable']>0]
tehran_comp_data=tehran_comp_data[~tehran_comp_data['biker id'].isin(list(noSheba_comp_data['biker id']))]

In [43]:
tehran_comp_data=tehran_comp_data[['biker id', 'sheba number','total payable','name_family','express trips']]
payment_comp_data=payment_comp_data[['biker id', 'sheba number','total payable','name_family','express trips']]

In [44]:
aa=pd.merge(tehran_comp_data,payment_comp_data, on='biker id', how='left')

In [45]:
aa['express trips_y'].isnull().sum()

0

In [46]:
tehran_comp_data.reset_index(drop=True, inplace=True)
payment_comp_data.reset_index(drop=True, inplace=True)

In [47]:
tehran_comp_data['concated'] = tehran_comp_data['biker id'].apply(str)+'_'+tehran_comp_data['sheba number'].apply(str)+'_'+tehran_comp_data['total payable'].apply(str)+'_'+tehran_comp_data['name_family'].apply(str)
payment_comp_data['concated'] = payment_comp_data['biker id'].apply(str)+'_'+payment_comp_data['sheba number'].apply(str)+'_'+payment_comp_data['total payable'].apply(str)+'_'+payment_comp_data['name_family'].apply(str)

C:\Users\SnappFood\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [48]:
payment_comp_data

,biker id,sheba number,total payable,name_family,express trips,concated
0,16,IR350170000000302202936005,755500,مرتضی بخشی,53,16_IR350170000000302202936005_755500_مرتضی بخشی
1,277,IR360150000000817302320910,4050400,مصطفی خفاجه نیا,312,277_IR360150000000817302320910_4050400_مصطفی ...
2,289,IR750600380970011115506001,3598000,رضا پروین,255,289_IR750600380970011115506001_3598000_رضا پر...
3,303,IR190170000000212611964006,2358000,محمد ازاد,194,303_IR190170000000212611964006_2358000_محمد ازاد
4,307,IR470540103282000099657001,908500,بهروز مومنی ثانی رشخوار,67,307_IR470540103282000099657001_908500_بهروز مو...
...,...,...,...,...,...,...
5479,49689,IR470150000003130004395228,48000,معرفت احمدی,3,49689_IR470150000003130004395228_48000_معرفت ا...
5480,49697,IR230170000000218759052008,395000,مهدی میرزایی,31,49697_IR230170000000218759052008_395000_مهدی م...
5481,49701,IR430190000000116903927007,165000,علی مرادی,12,49701_IR430190000000116903927007_165000_علی مرادی
5482,49705,IR280170000000355344471006,60000,میلاد آدینه وند,3,49705_IR280170000000355344471006_60000_میلاد آ...
5483,13898,IR900140040000710122488061,554900,محمد حیدری,40,13898_IR900140040000710122488061_554900_محمد ح...

In [49]:
tehran_comp_data

,biker id,sheba number,total payable,name_family,express trips,concated
0,16,IR350170000000302202936005,755500,مرتضی بخشی,53,16_IR350170000000302202936005_755500_مرتضی بخشی
1,277,IR360150000000817302320910,4050400,مصطفی خفاجه نیا,312,277_IR360150000000817302320910_4050400_مصطفی ...
2,289,IR750600380970011115506001,3598000,رضا پروین,255,289_IR750600380970011115506001_3598000_رضا پر...
3,303,IR190170000000212611964006,2358000,محمد ازاد,194,303_IR190170000000212611964006_2358000_محمد ازاد
4,307,IR470540103282000099657001,908500,بهروز مومنی ثانی رشخوار,67,307_IR470540103282000099657001_908500_بهروز مو...
...,...,...,...,...,...,...
5479,49685,IR190150000003130001739096,498000,عاشور خواجوی,40,49685_IR190150000003130001739096_498000_عاشور ...
5480,49689,IR470150000003130004395228,48000,معرفت احمدی,3,49689_IR470150000003130004395228_48000_معرفت ا...
5481,49697,IR230170000000218759052008,395000,مهدی میرزایی,31,49697_IR230170000000218759052008_395000_مهدی م...
5482,49701,IR430190000000116903927007,165000,علی مرادی,12,49701_IR430190000000116903927007_165000_علی مرادی
5483,49705,IR280170000000355344471006,60000,میلاد آدینه وند,3,49705_IR280170000000355344471006_60000_میلاد آ...

In [50]:
results_of_diff=tehran_comp_data['concated'].compare(payment_comp_data['concated'])

In [51]:
results_of_diff

,self,other
1331,13898_IR900140040000710122488061_554900_محمد ح...,13901_IR830570034180013628468101_934200_فرهاد ...
1332,13901_IR830570034180013628468101_934200_فرهاد ...,13902_IR900560081777702583521001_775000_پیام ی...
1333,13902_IR900560081777702583521001_775000_پیام ی...,13909_IR270570027880013631455101_75000_امیر رض...
1334,13909_IR270570027880013631455101_75000_امیر رض...,13912_IR350120010000005792555291_3511300_مجید ...
1335,13912_IR350120010000005792555291_3511300_مجید ...,13921_IR270150000001350301327712_3026100_عبدال...
...,...,...
5479,49685_IR190150000003130001739096_498000_عاشور ...,49689_IR470150000003130004395228_48000_معرفت ا...
5480,49689_IR470150000003130004395228_48000_معرفت ا...,49697_IR230170000000218759052008_395000_مهدی م...
5481,49697_IR230170000000218759052008_395000_مهدی م...,49701_IR430190000000116903927007_165000_علی مرادی
5482,49701_IR430190000000116903927007_165000_علی مرادی,49705_IR280170000000355344471006_60000_میلاد آ...
5483,49705_IR280170000000355344471006_60000_میلاد آ...,13898_IR900140040000710122488061_554900_محمد ح...

In [52]:
results_of_diff.to_excel('E:Weekly Payments/Output_files/different payment and tehran.xlsx')

In [53]:
payment_comp_data

,biker id,sheba number,total payable,name_family,express trips,concated
0,16,IR350170000000302202936005,755500,مرتضی بخشی,53,16_IR350170000000302202936005_755500_مرتضی بخشی
1,277,IR360150000000817302320910,4050400,مصطفی خفاجه نیا,312,277_IR360150000000817302320910_4050400_مصطفی ...
2,289,IR750600380970011115506001,3598000,رضا پروین,255,289_IR750600380970011115506001_3598000_رضا پر...
3,303,IR190170000000212611964006,2358000,محمد ازاد,194,303_IR190170000000212611964006_2358000_محمد ازاد
4,307,IR470540103282000099657001,908500,بهروز مومنی ثانی رشخوار,67,307_IR470540103282000099657001_908500_بهروز مو...
...,...,...,...,...,...,...
5479,49689,IR470150000003130004395228,48000,معرفت احمدی,3,49689_IR470150000003130004395228_48000_معرفت ا...
5480,49697,IR230170000000218759052008,395000,مهدی میرزایی,31,49697_IR230170000000218759052008_395000_مهدی م...
5481,49701,IR430190000000116903927007,165000,علی مرادی,12,49701_IR430190000000116903927007_165000_علی مرادی
5482,49705,IR280170000000355344471006,60000,میلاد آدینه وند,3,49705_IR280170000000355344471006_60000_میلاد آ...
5483,13898,IR900140040000710122488061,554900,محمد حیدری,40,13898_IR900140040000710122488061_554900_محمد ح...

## 2. Database checking

In [13]:
import pyodbc

In [14]:
def connection():
    server = '79.175.132.125,1410'
    database = 'express_db'
    username = 'ExpressAnalyst'
    password = '^cVGXN6q[nY#[-GE'
    Driver = 'SQL Server'
    cnxn = pyodbc.connect(
            'DRIVER={SQL Server};SERVER=' + server + ';DATABASE=' + database + ';UID=' + username + ';PWD=' + password)
    cursor = cnxn.cursor()
    return cursor

In [15]:
query_1="""SELECT user_id,
       count(distinct id) as tedad
from  express_db..trip
where trip_status like '%Delivered%'
  and created_at >= '2022-04-09'
  and created_at < '2022-04-16'
  and user_id <> 1
  -- and t.city_id = 1
  
group by user_id"""

In [16]:
cursor=connection()

In [17]:
cursor.execute(query_1)

### 2.1 retrieve bikers trips from database

In [18]:
online_data=cursor.fetchall()

In [19]:
online_list=[list(biker) for biker in online_data]
len(online_list)

5549

In [20]:
online_df=pd.DataFrame(online_list,columns=['biker id','db_trips'])

In [21]:
online_df.to_csv('E:/Weekly Payments/Output_files/database_data.csv')

In [22]:
# online_df=pd.read_csv('E:/Weekly Payments/Output_files/database_data.csv')
# online_df.drop(columns=['Unnamed: 0'], inplace=True)

In [23]:
online_df

      biker id  db_trips
0        37470        65
1        37138       138
2        18068       182
3        24904        76
4        28957       325
...        ...       ...
5544     44505        15
5545     44605       104
5546     29998        46
5547      2756        39
5548       933        73

[5549 rows x 2 columns]

### 2.2 compare number of trips from concanetated data and data base data

In [24]:
Payments=data['payment']

In [25]:
len(Payments)

5484

In [26]:
#Payments=Payments[Payments['Express Trips']>0]

In [27]:
Payments=Payments[['biker id', 'express trips']]

In [30]:
## حذف بایکر ها با شبای مشکل دار و مقدار پرداختی منفی از دیتای دیتابیس
online_df=online_df[~online_df['biker id'].isin(list(data['no sheba']['biker id']))]
online_df=online_df[~online_df['biker id'].isin(list(negative_payable['biker id']))]

In [31]:
online_df

      biker id  db_trips
0        37470        65
1        37138       138
2        18068       182
3        24904        76
4        28957       325
...        ...       ...
5544     44505        15
5545     44605       104
5546     29998        46
5547      2756        39
5548       933        73

[5475 rows x 2 columns]

In [74]:
# left join on Biker Id between concanetated_date
# extract bikers who are in the payment list and don't have rides
#bikers_no_ride=pd.merge(c_data,online_df,on='Biker Id',how='left')

In [75]:
# are not in the database but have trips in the file
bikers_no_payment=pd.merge(online_df,Payments,on='biker id',how='left')

In [76]:
bikers_no_payment

      biker id  db_trips  express trips
0        40458       253          253.0
1        32870       201          202.0
2        16176        64           66.0
3        49349         5            5.0
4        19734       184          184.0
...        ...       ...            ...
5470      2476       233          234.0
5471     20031        56           56.0
5472     42845         3            3.0
5473     44113       186          185.0
5474      2115        91           92.0

[5475 rows x 3 columns]

In [77]:
bikers_no_payment.to_csv('E:Weekly Payments/bikers.csv')

In [78]:
bikers_no_payment['express trips'].isnull().sum()  # bikers with trips in database and not in the file

1

In [79]:
bikers_no_payment['db_trips'].isnull().sum()

0

In [80]:
len(bikers_no_payment)

5475

In [81]:
bikers_no_payment_2=pd.merge(Payments,online_df,on='biker id',how='left')

In [82]:
bikers_no_payment_2['express trips'].isnull().sum()

0

In [83]:
bikers_no_payment_2[bikers_no_payment_2['db_trips'].isnull()]

      biker id  express trips  db_trips
865       7045              1       NaN
869       7066              1       NaN
1460     14376              1       NaN
2063     17613              1       NaN
2160     18021              0       NaN
2343     19782              1       NaN
2577     20641              2       NaN
2757     21148              1       NaN
3570     29617              1       NaN
5033     45145              1       NaN

## بایکر های این قسمت در دیتابیس تریپ دارند ولی در فایل نیستند

In [84]:
bikers_no_payment[bikers_no_payment['express trips'].isnull()]

      biker id  db_trips  express trips
1863     20008        10            NaN

### 2.3 calculate the difference between Db trips and payment trips

In [85]:
bikers_no_payment.fillna(0, inplace=True)

In [86]:
bikers_no_payment['diff']=abs(bikers_no_payment['express trips']-bikers_no_payment['db_trips'])

In [87]:
bikers_no_payment=bikers_no_payment[~bikers_no_payment['biker id'].isin(list(data['no sheba']['biker id']))]
bikers_no_payment=bikers_no_payment[~bikers_no_payment['biker id'].isin(list(negative_payable['biker id']))]

In [88]:
bikers_no_payment[bikers_no_payment['diff']>4].sort_values(by=['biker id'])

      biker id  db_trips  express trips  diff
5465     16044       373          378.0   5.0
1863     20008        10            0.0  10.0
1459     20508       328          333.0   5.0
2295     20880       344          350.0   6.0
4495     27466       265          270.0   5.0
4587     29153       264          269.0   5.0
5190     39613       100          106.0   6.0

In [89]:
bikers_no_payment[bikers_no_payment['diff']>4].sort_values(by=['biker id']).to_excel('E:\Diffoutput.xlsx')

In [90]:
len(bikers_no_payment[bikers_no_payment['diff']>4])

7

In [91]:
bikers_with_diff=bikers_no_payment[bikers_no_payment['diff']>4]['biker id'].to_list()

In [92]:
bikers_with_diff

[20508, 20008, 20880, 27466, 29153, 39613, 16044]

## Financial Checking

In [93]:
a = os.listdir('E:/Weekly Payments/tasvieh_file')

In [94]:
d=pd.read_excel('E:/Weekly Payments/tasvieh_file/'+a[0],sheet_name=None,header=1)

In [95]:
tasvieh_data=d['pattern-1'].copy(deep=True)

In [96]:
tasvieh_data.columns

Index(['شماره سپرده ی مبدا', 'شماره مشتری', 'مبلغ', 'کد بانک مقصد',
       'نام و نام خانوادگی ذینفع', 'شرح تراکنش', 'شبای مقصد', 'تاریخ ارسال',
       'شناسه واریز(اختیاری)'],
      dtype='object')

In [97]:
tasvieh_data.head()

,شماره سپرده ی مبدا,شماره مشتری,مبلغ,کد بانک مقصد,نام و نام خانوادگی ذینفع,شرح تراکنش,شبای مقصد,تاریخ ارسال,شناسه واریز(اختیاری)
0,NaN,NaN,6670000,17,مرتضی بخشی,تسویه سفرهای اکسپرس اسنپ فود,IR350170000000302202936005,NaN,NaN
1,NaN,NaN,13135000,60,رضا پروین,تسویه سفرهای اکسپرس اسنپ فود,IR750600380970011115506001,NaN,NaN
2,NaN,NaN,18890000,17,محمد ازاد,تسویه سفرهای اکسپرس اسنپ فود,IR190170000000212611964006,NaN,NaN
3,NaN,NaN,11485000,54,بهروز مومنی ثانی رشخوار,تسویه سفرهای اکسپرس اسنپ فود,IR470540103282000099657001,NaN,NaN
4,NaN,NaN,19770000,57,حامد فانی صابری,تسویه سفرهای اکسپرس اسنپ فود,IR260570029080012882866101,NaN,NaN

In [98]:
tasvieh_data.rename(columns={'مبلغ':'payable','نام و نام خانوادگی ذینفع':'name','شبای مقصد':'sheba number' }, inplace=True, errors='raise')

In [99]:
tasvieh_data.drop(columns=['شماره سپرده ی مبدا','شماره مشتری','کد بانک مقصد','شرح تراکنش','تاریخ ارسال','شناسه واریز(اختیاری)'], inplace=True, errors='raise')

In [100]:
tasvieh_data.head()

    payable                     name                sheba number
0   6670000             مرتضی  بخشی   IR350170000000302202936005
1  13135000              رضا  پروین   IR750600380970011115506001
2  18890000                محمد ازاد  IR190170000000212611964006
3  11485000  بهروز مومنی ثانی رشخوار  IR470540103282000099657001
4  19770000         حامد فانی صابری   IR260570029080012882866101

In [101]:
payment_comp=data['payment']

In [102]:
tasvieh_data.sort_values(by='sheba number', inplace=True)

In [103]:
payment_comp.sort_values(by='sheba number', inplace=True)

In [104]:
tasvieh_data.reset_index(drop=True, inplace=True)
payment_comp.reset_index(drop=True, inplace=True)

In [105]:
tas_comp=tasvieh_data[['sheba number','name']]
pay_comp=payment_comp[['sheba number','name_family']]

In [106]:
pd.merge(tas_comp,pay_comp, on='sheba number', how='left')

,sheba number,name,name_family
0,IR020120000000008840251909,ابوالفضل دهقانی,ابوالفضل دهقانی
1,IR020120010000000150944317,امان محمد قربانی قودنه,امان محمد قربانی قودنه
2,IR020120010000001437361809,علیرضا احمدی,علیرضا احمدی
3,IR020120010000004197615149,محمد تاقانی,محمد تاقانی
4,IR020120010000004247067592,حمزه خجمی‌‌,NaN
...,...,...,...
5029,IR980570350270011610720101,محمد محمدی تجلی,محمد محمدی تجلی
5030,IR980610000000700833300505,مصطفی قرناسی,مصطفی قرناسی
5031,IR980660000000201227875008,فرشاد جعفرآبادی,NaN
5032,IR980700001000117916505001,خلیل پروین,خلیل پروین
5033,lR080620000000302950955009,اسماعیل مشکانی,اسماعیل مشکانی

In [107]:
ccc=pd.merge(tas_comp,pay_comp, on='sheba number', how='right')

In [108]:
ccc[ccc['name'].isnull()]

                    sheba number name             name_family
8     IR020150000000501301988304  NaN         اسماعیل سرای لو
9     IR020150000001274301671701  NaN           مقداد  پرموزه
13    IR020160000000000268487941  NaN           عبدالله هرمزی
19    IR020170000000331729620005  NaN            مسلم نیازیان
36    IR020190000000308358733008  NaN            بهمن حیدرنیا
...                          ...  ...                     ...
5463  IR980190000000112040314007  NaN           محسن فریمانهء
5464  IR980190000000330471607007  NaN          حسن سردارآبادی
5467  IR980540101582000304504009  NaN              محسن محمدی
5476  IR980570031480015043436101  NaN             محمد بنیادی
5481  IR980610000000700833583357  NaN  مصطفی  صانعی ممر آبادی

[1282 rows x 3 columns]

In [109]:
ccc['name'].isnull().sum()

1282

In [110]:
ccc['name_family'].isnull().sum()

0

In [111]:
payment_comp.shape

(5484, 34)

In [112]:
tas_comp.shape

(5034, 2)

In [113]:
tasvieh_data['concated']=tasvieh_data['sheba number'].apply(str)+'_'+tasvieh_data['name'].apply(str)+'_'+tasvieh_data['payable'].apply(str)
payment_comp['concated']=payment_comp['sheba number'].apply(str)+'_'+payment_comp['name_family'].apply(str)+'_'+payment_comp['rial_payable'].apply(str)

In [114]:
print(len(tasvieh_data['concated']))
print(len(payment_comp['concated']))

5034
5484

In [115]:
tasvieh_data['concated'].compare(payment_comp['concated'])#.to_excel('E:/Weekly Payments/pay_tas_diff.xlsx')

ValueError: Can only compare identically-labeled Series objects

In [ ]:
comparison_column = np.where(tasvieh_data['concated'] == payment_comp['concated'], True, False)

In [ ]:
tas_comp=pd.merge(tasvieh_data,payment_comp, on='concated', how='left')

In [ ]:
tas_comp[tas_comp['rial_payable']==None]

In [ ]:
len(tas_comp)

In [ ]:
for i in range(len(comparison_column)):
    if comparison_column[i]==False:
        print('false')
        print(i)

In [ ]:
if len(data['payment']==len(tasvieh_data)):
    print('Both have the same number of data')

In [ ]:
# compare Sheba numbers
payment_sheba=data['payment']['sheba number'].values
tasvieh_data_sheba=tasvieh_data['sheba number'].values

In [ ]:
tasvieh_data.sort_values(by=['sheba number'], inplace=True)

In [ ]:
data['payment'].sort_values(by=['sheba number'], inplace=True)
tasvieh_data.sort_values(by=['sheba number'], inplace=True)

In [ ]:
tasvieh_data.reset_index(drop=True, inplace=True)
data['payment'].reset_index(drop=True, inplace=True)

In [ ]:
#data['Payment']['Total Payable']=data['Payment']['Total Payable']*100

In [ ]:
len(tasvieh_data['sheba number'].values)

In [ ]:
tasvieh_data.head()

In [ ]:
data['payment'].head()

In [ ]:
# financial_differ=[]

In [ ]:
# counter=0
# for i in range(len(data['Payment'])):
#     a=data['Payment'].iloc[i]
#     b=tasvieh_data.iloc[i]
#     if (a['name_family']==b['name']) and (a['Sheba Number']==b['Sheba Number']) and (int(a['rial_payable'])==b['payable']):
#         counter+=1
#     else:
#         print(a['name_family'])
#         print(b['name'])
#         print(a['name_family']==b['name'])
#         print(a['Sheba Number'],b['Sheba Number'])
#         print(a['Sheba Number']==b['Sheba Number'])
#         print(a['rial_payable']==int(b['payable']))
#         print(a['rial_payable'],int(b['payable']))
#         print(int(a['rial_payable']))
#         print(int(b['payable']))
#         financial_differ.append(a['name_family'])
#         financial_differ.append(b['name'])
#         financial_differ.append(a['Sheba Number'])
#         financial_differ.append(a['rial_payable'])
# print(counter)
# print(financial_differ)

In [ ]:
if sum(data['payment']['rial_payable'])==sum(tasvieh_data['payable']):
    print('equal payment summation in both files')

In [ ]:
print(sum(data['payment']['rial_payable']))

In [ ]:
print(sum(tasvieh_data['payable']))